app/views/photos/index.html.erb

SELECT COUNT(*) FROM "likes"  WHERE "likes"."photo_id" = $1  [["photo_id", 4]]
---

				<span class="likes_count"> <%= photo.likes.count %></span> Likes

SELECT  1 AS one FROM "comments"  WHERE "comments"."photo_id" = $1 LIMIT 1  [["photo_id", 12]]
SELECT "comments".* FROM "comments"  WHERE "comments"."photo_id" = $1  [["photo_id", 13]]
---
				<div class="comments">
					<% if photo.comments.any? %>