app/controllers/comments_controller.rb

SELECT  "photos".* FROM "photos"  WHERE "photos"."id" = $1 LIMIT 1  [["id", 13]]
---
	def new
		@photo = Photo.find(params[:photo_id])

SELECT  "photos".* FROM "photos"  WHERE "photos"."id" = $1 LIMIT 1  [["id", 13]]
INSERT INTO "comments" ("comment", "created_at", "photo_id", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["comment", "sjfnlsdk"], ["created_at", "2015-01-12 11:05:42.010509"], ["photo_id", 16], ["updated_at", "2015-01-12 11:05:42.010509"]]
---
	def create
		@photo = Photo.find(params[:photo_id])
		@photo.comments.create(comment_params)