app/controllers/likes_controller.rb

	def create
		@photo = Photo.find(params[:photo_id])
		@photo.likes.create
		render json: { new_like_count: @photo.likes.count }
---
SELECT  "photos".* FROM "photos"  WHERE "photos"."id" = $1 LIMIT 1  [["id", 4]]
INSERT INTO "likes" ("created_at", "photo_id", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2015-01-15 16:29:09.417342"], ["photo_id", 4], ["updated_at", "2015-01-15 16:29:09.417342"]]
SELECT COUNT(*) FROM "likes"  WHERE "likes"."photo_id" = $1  [["photo_id", 4]]