app/controllers/photos_controller.rb

	def create
		@photo = Photo.new(photo_params)
		@photo.save
---
INSERT INTO "photos" ("comment", "created_at", "picture_content_type", "picture_file_name", "picture_file_size", "picture_updated_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

	def update
		@photo = Photo.find(params[:id])
		@photo.update(photo_params)
---
SELECT  "photos".* FROM "photos"  WHERE "photos"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "photos" SET "comment" = $1, "updated_at" = $2 WHERE "photos"."id" = 1  [["comment", "Olay"], ["updated_at", "2015-01-05 18:54:45.301766"]]

	def destroy
		@photo = Photo.find(params[:id])
		@photo.delete
---
SELECT  "photos".* FROM "photos"  WHERE "photos"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "photos" WHERE "photos"."id" = 1